---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.RebarShapeConstraintRadius
source: html/f622c520-5672-fadc-8fd5-d2a54154b374.htm
---
# RebarShapeConstraintRadius Properties

The choice of rule for measuring the radius.